# -*- org-export-babel-evaluate: nil -*-
#+OPTIONS: toc:nil num:nil ^:{}
#+BEGIN_HTML
---
title: Documented and repeatable "mini-experiments"
author: Ashley Gillman
layout: post
tags: Org mode, emacs, docker
---
#+END_HTML

#+BEGIN_SRC emacs-lisp :results none :exports none
;; use html body-only export: C-c C-e C-b h h
;;(require 'ox-md)
(require 'ox-bibtex)
#+END_SRC

@@html:<i>@@
In this post I outline my workflow on how I conduct my
"mini-experiments", code and notes that may otherwise be
"throw-away". You can see and example of what this looks like [[http://ashgillman.github.io/experiments/][here]].
@@html:</i>@@

#+TOC: headlines 3

When learning, using and creating algorithms and computational tools,
an important part of the process is playing around. This involves
getting to know the tools, specific commands, trying out ideas,
etc. Typically, for me, this might involve creating a bunch of python
files with half-meaningful names in a folder with some input data and
result files. Unfortunately, this does not leave my findings in a very
usable format. If I months later decide I want to look over a similar
idea or pass my findings to someone else I have to trawl back through
these files, or redo the experiments.

What is needed is a way to organise these ideas together, embedding
the test code and results within a document. An easy way to do this is
to simply copy-paste any code and results into a text or Word document
with some comments. Presented in this post is an alternative workflow,
which I find far more satisfactory. In this workflow, thanks to Org
Mode, the code is embedded within the document, along with the
results.

At our workplace we have a DNS server, that means it is very easy to
remotely connect to a computer without remembering an IP address. We
also use a VPN. This means that if I use my computer to host my notes
over HTTP, I can easily get access to my notes anywhere in the world,
* Setting up an experimental environment
I keep all my experiments in my home directory, =~/experiments=. This
directory looks like:

#+BEGIN_SRC sh :exports results :results output
echo \$ tree "~/experiments"
echo ""
tree ~/experiments | grep "-"
#+END_SRC

#+RESULTS:
: $ tree ~/experiments
: 
: |-- 2016-03-13-random-exploration
: |   `-- index.org
: `-- template.org

The first important file here is =template.org=. Using this file, I
can quickly start a new experiment using:

#+BEGIN_SRC sh :exports code :dir ~/experiments
mkdir 2016-03-13-random-exploration
cp template.org 2016-03-13-random-exploration/index.org
#+END_SRC

#+RESULTS:

Lets have a look at its contents.

#+HEADERS: :exports code
#+INCLUDE: "~/experiments/template.org" src org

The first block of code is some standard templating, setting myself as
the author, and my email address. Options keywords can be found
[[http://orgmode.org/manual/Export-settings.html][here]]. The next section, under the =Setup= heading is interesting. The
=:noexport:= tag means that this section will not appear in the
exported document. However, it does contain a source block with a Nix
expression. I have this set up to, by default, set up a basic Python 3
environment. Doing so ensures that we know exactly what libraries our
experiments are using, and ensures that even years later we will be
able to repeat our experiments.

The Directory Listing section simply contains a python script that
will provide a link to each file and folder in the directory. This is
just for convenience when later exploring the results. The Aim,
Methodology and Results headings are empty, just providing
placemarkers for later. Finally, the Local Variables sets up Emacs
file-local variables. Here I instruct org-mode to evaluate all results
when the file is exported (this may need to be changed at some point
if the code takes a long time to run), disable confirmation messages
(be careful if you didn't write the code), allow links to =.org=
files, and set the HTML footer. Lastly, and importantly, I change the
python command to run via =nix-shell --pure", which uses the
environment defined in the Setup section.

I have hosted an example with some toy experiments at
[[http://ashgillman.github.io/experiments/]]. The source code for one such
experiment can be seen [[https://raw.githubusercontent.com/ashgillman/experiments/master/2016-03-13-random-exploration/index.org][here]], and its rendered output, [[http://ashgillman.github.io/experiments/2016-03-13-random-exploration/][here]]. Great!

The index file at [[http://ashgillman.github.io/experiments/]] is
generated using =gen_index.py=. Let's have a look at its source:

#+HEADERS: :exports code
#+INCLUDE: "~/experiments/gen_index.py" src python

This is just a very simple script to make a very simple index. You
mightn't even want to use it, opting instead for something like
Apache's [[https://wiki.apache.org/httpd/DirectoryListings][default]] indexing.

